// constants.ts
export const KERNEL_PRESETS = [
  {
    name: 'Тождественное отображение',
    values: [0, 0, 0, 0, 1, 0, 0, 0, 0],
    scale: 1,
  },
  {
    name: 'Повышение резкости',
    values: [0, -1, 0, -1, 5, -1, 0, -1, 0],
    scale: 1,
  },
  {
    name: 'Фильтр Гаусса (3x3)',
    values: [1, 2, 1, 2, 4, 2, 1, 2, 1],
    scale: 16,
  },
  {
    name: 'Прямоугольное размытие',
    values: [1, 1, 1, 1, 1, 1, 1, 1, 1],
    scale: 9,
  },
  {
    name: 'Прюитт (горизонтальный)',
    values: [-1, 0, 1, -1, 0, 1, -1, 0, 1],
    scale: 1,
  },
  {
    name: 'Прюитт (вертикальный)',
    values: [-1, -1, -1, 0, 0, 0, 1, 1, 1],
    scale: 1,
  },
];
